{
    "script": "Une urne contient 8 boules blanches et 2 boules noires, indiscernables au toucher. On tire sans remise et successivement 3 boules de cette urne.Quelle est la probabilité qu'au moins une boule noire figure dans le tirage?Sachant qu'au moins une boule noire figure dans le tirage, quelle est la probabilité que la première boule tirée soit noire?",
    "hint": "Dénombrer!Dénombrer les tirages tels que la première boule est noire, et appliquer la définition des probabilités conditionnelles.",
    "solution": "Distinguons les boules et ordonnons les tirages. Il y a $10\\times 9\\times 8$ tirages possibles. Calculons maintenant le nombre de tirages comprenant au moins une boule noire. Il y a deux possibilités :Le tirage ne comporte qu'une seule boule noire. Il y a 3 façons de choisir la position de la boule noire (lors du premier tirage, du deuxième, etc...), 2 choix pour cette boule, et ensuite $8\\times 7$ choix pour les deux boules blanches. En tout, il y a donc $3\\times 2\\times 8\\times 7$ tirages correspondants.Le tirage comporte les deux boules noires. On choisit d'abord les deux tirages où on a pris les boules noires : on choisit 2 places parmi 3, soit $\\binom 32=3$. Ce choix fait, il y a 2 choix pour les boules noires, et 8 choix pour les boules blanches. Il y a donc en tout  $3\\times 2\\times 8$ tels tirages.Le nombre total de tirages est donc $6\\times 8\\times 8$ et si on note $B$ l'événement \"Au moins une boule noire figure dans le tirage\", alors la probabilité de $B$ est égale à \r\n$$P(B)=\\frac{6\\times 8\\times 8}{10\\times 9\\times 8}=\\frac{8}{15}.$$\r\nRemarquons que, comme souvent dans ce type d'exercice, il est plus facile de déterminer la probabilité du complémentaire : en effet, $\\bar B$ est l'événement \"on ne tire que des boules blanches\". Le nombre de tirages correspondant est $8\\times 7\\times 6$ et donc \r\n$$P(\\bar B)=\\frac{8\\times 7\\times 6}{10\\times 9\\times 8}=\\frac{7\\times 6}{10\\times 9}=\\frac{7}{15}$$\r\nce qui est bien la valeur attendue (ouf)!Le dénombrement du nombre de tirages tels que la première boule soit noire est plus simple. Il y a exactement $2\\times 9\\times 8$ tirages. Si $A$ est l'événement : \"La première boule tirée est noire\", alors \r\n$$P(A)=\\frac{2\\times 9\\times 8}{10\\times 9\\times 8}=\\frac 15.$$\r\nOn cherche $P(A|B)$. Par définition, \r\n$$P(A|B)=\\frac{P(A\\cap B)}{P(B)}=\\frac{P(A)}{P(B)}=\\frac 38$$\r\npuisque $A\\subset B$.",
    "lang": "french"
}