{
    "script": "Dans mon armoire, il y a 5 paires de chaussures noires, 3 paires de chaussures marrons et 2 paires de chaussures blanches. Je peux distinguer toutes ces chaussures les unes des autres. Un matin, mal réveillé, je choisis deux chaussures au hasard.Combien y-a-t-il de choix possibles ?Combien y-a-t-il de choix où j'obtiens deux chaussures de même couleur ?Combien de choix amènent un pied gauche et un pied droit ?Combien de choix amènent une chaussure droite et une chaussure gauche de même couleur ?Combien de choix amènent à deux chaussures qui ne sont pas de la même paire?",
    "hint": "On choisit deux chaussures parmi 20.Commencer par compter le nombre de choix qui amènent deux chaussures noires.Combien de choix pour choisir une chaussure pied gauche? pied droit? Faire un arbre...Commencer par compter le nombre de choix qui amènent une chaussure droite et une chaussure gauche qui sont toutes les deux noires.Dénombrer le complémentaire.",
    "solution": "Les chaussures étant discernables, j'ai choisi 2 chaussures parmi les 20 de mon armoire. Il y a donc $\\binom{20}2=190$ choix possibles.Notons $E$ les tirages qui m'amènent à des chaussures de même couleur, et $E_N$, $E_M$, $E_B$ les tirages qui m'amènent à deux chaussures noires (resp. marron, resp. blanches). Alors $E=E_N\\cup E_M\\cup E_B$ et cette réunion est disjointe. On a donc\r\n$$\\textrm{card}(E)=\\textrm{card}(E_N)+\\textrm{card}(E_M)+\\textrm{card}(E_B).$$\r\nOr, $\\textrm{card}(E_N)=\\binom{10}2$, puisque je peux choisir 2 chaussures parmi 10. Finalement,\r\n$$\\textrm{card}(E)=\\binom{10}2+\\binom{6}2+\\binom 42=66.$$Il y a 10 choix possibles pour la chaussure droite. Une fois ce choix réalisé, il y a 10 choix possibles pour la chaussure gauche. Au total, il y a $10\\times 10=100$ choix possibles.Notons $A$ les tirages qui amènent une chaussure droite et une chaussure gauche de la même couleur. Comme précédemment, on va décomposer $A$ en $A_N\\cup A_M\\cup A_B$, où $A_N$ est l'ensemble des tirages amenant une chaussure droite noire et une chaussure gauche noire. On a $\\textrm{card}(A_N)=5^2$ ($5$ choix pour la chaussure droite, $5$ choix pour la chaussure gauche) et finalement\r\n$$\\textrm{card}(A)=5^2+3^2+2^2=38.$$On compte d'abord le nombre de choix de deux chaussures qui amènent la même paire : il y en a $10$ (autant que de paires de chaussures). Par différence, le nombre de choix qui amènent à deux chaussures qui ne sont pas de la même paire est $\\binom{20}2-10=180$.",
    "lang": "french"
}