{
    "script": "Une main au poker est formée de 5 cartes extraites d'un jeu de 52 cartes. Traditionnellement,trèfle, carreau, coeur, pique sont appelées couleurs et les valeurs des cartes sont rangées dans l'ordre : as, roi, dame, valet, 10, 9, 8, 7, 6, 5, 4, 3, 2, de la plus forte à la plus faible. Dénombrer les mains suivantes :quinte flush : main formée de 5 cartes consécutives de la même couleur (Attention! la suite as, 2, 3, 4 et 5 est une quinte flush).carré : main contenant 4 cartes de la même valeur (4 as par exemple).full : main formée de 3 cartes de la même valeur et de deux autres cartes de même valeur (par exemple, 3 as et 2 rois).quinte : main formée de 5 cartes consécutives et qui ne sont pas toutes de la même couleur.brelan : main comprenant 3 cartes de même valeur et qui n'est ni un carré, ni un full (par exemple, 3 as, 1 valet, 1 dix).",
    "hint": "On choisit la couleur puis la hauteur de la plus haute carte.On choisit la hauteur, puis la dernière carte.Choisir les deux hauteurs, puis 3 cartes parmi 4, et 2 cartes parmi 4.Raisonner par différence en utilisant le résultat pour les quintes flush.Raisonner par différence.",
    "solution": "Il y a 4 choix pour la couleur. La couleur choisie, il suffit de choisir la plus haute carte de la main : il s'agit de n'importe quelle carte entre le 5 et l'as. Il y a donc 10 choix choix possibles pour la hauteur de la plus haute carte, et donc $4\\times 10=40$ mains conduisant à une quinte flush.Il y a 13 choix possibles pour la hauteur de la carte constituant le carré (carré d'as, carré de rois,...). Cette hauteur fixée, il faut encore choisir une carte parmi les 48 autres pour compléter la main. Il y a donc $13\\times 48=624$ mains contenant un carré.On choisit d'abord la hauteur des 3 cartes de même valeur. Il y a 13 choix. On choisit alors ces 3 cartes de même valeur. Il y a $\\binom 43=4$ choix possibles. On choisit ensuite la hauteur des deux autres cartes. Il reste 12 choix. Puis on choisit ces 2 cartes de même valeur. Il y a $\\binom 42=6$ choix. Finalement, le nombre de mains constituant un full est\r\n$$13\\times 4\\times 12\\times 6=3744.$$On va dénombrer d'abord le nombre de mains constituée de 5 cartes consécutives, qu'elles soient ou non de la même couleur. On retirera ensuite le nombres de quintes flush pour obtenir le nombres de mains constituées de 5 cartes qui ne sont pas toutes de la même couleur. Si on compte le nombre de mains constituées de 5 cartes consécutives, qu'elles soient ou non de la même couleur, alors on doit choisir la hauteur de la carte la plus haute. Comme précédemment, il y a 10 choix possibles. Ensuite, pour chacune des cinq hauteurs consécutives, on choisit l'une des 4 couleurs, ce qui fait $4^5$ choix. Finalement, le nombre de mains correspondant est $10\\times 4^5=10240$ ce qui fait que le nombre de quintes est exactement $10240-40=10200$.On compte le nombre de mains comprenant 3 cartes de même niveau et qui ne contient pas un carré : il y a 13 choix pour le niveau, $\\binom 43=4$ choix de 3 couleurs parmi 4 pour ce niveau. Puis, pour les deux autres cartes, il faut choisir deux cartes parmi 48 (on doit exclure la dernière carte de même hauteur, sinon on aurait un carré), soit $\\binom {48} 2=48\\times 47/2=1128$ choix. Il y a donc $13\\times 4\\times 1128=58656$ mains contenant 3 cartes de même niveau, mais pas de carrés. Pour dénombrer le nombre de brelans, il faut retirer les fulls. Il y a donc $58656-3744=54912$ brelans.Attention au raisonnement faux suivant : on pourrait compter le nombre de mains comprenant 3 cartes de même niveau : il y a 13 choix pour le niveau, $\\binom 43=4$ choix de 3 couleurs parmi 4 pour ce niveau. Puis, pour les deux autres cartes, il faut choisir deux cartes parmi 52-3=49, soit $\\binom {49} 2=49\\times 48/2=1176$ choix. Il y a donc $13\\times 4\\times 1176=61152$ mains contenant 3 cartes de même niveau. Pour dénombrer le nombre de brelans, il faut retirer les carrés et les fulls. Il y a donc $61152-624-3744=56784$ brelans. Ce raisonnement est faux car quand on a compté le nombre de mains contenant 3 cartes de même niveau, on a compté 4 fois chaque carré. En effet, un carré d'as peut apparaitre en choisissant d'abord as de coeur, de carreau, de trèfle, puis en complétant avec as de pique, ou en choisissant as de coeur, de carreau, de pique, puis en complétant avec as de trèfle, etc... Si on veut réaliser un dénombrement correct avec cette méthode, il faut retirer quatre fois le nombre de carrés, et on a bien $61152-4\\times 624-3744=54912$.",
    "lang": "french"
}