{
    "script": "Soit $n$ un entier non nul. On désigne par $u_n$ le nombre de listes de $n$ termes, chaque terme étant $0$ ou $1$, et n'ayant pas deux termes $1$ consécutifs.Que vaut $u_1$? $u_2$?Démontrer que, pour tout $n\\geq 3$, on a $u_n=u_{n-1}+u_{n-2}$.Écrire un algorithme permettant de calculer $u_{20}$.Application : un concours comporte vingt questions, numérotées de 1 à 20. On a constaté que, parmi les 17712 personnes ayant participé au concours, aucune n'a répondu juste à deux questions consécutives. Peut-on affirmer que deux candidats au moins ont répondu de la même manière au questionnaire, c'est-à-dire juste aux mêmes questions et faux aux mêmes questions?",
    "hint": "Trier les listes : finissant par 0 ou finissant par 1.Associer à chaque questionnaire une liste de 0 et de 1.",
    "solution": "Il y a deux listes possibles à 1 terme, et aucune ne comporte deux 1 consécutifs. Donc $u_1=2$. Il y a 4 listes à 2 termes, dont une seule comporte deux 1 consécutifs. Donc $u_2=3$.Considérons une liste à $n$ termes n'ayant pas deux 1 consécutifs.ou bien elle se termine par un 1. Le terme précédent est donc forcément un 0, et pour les $n-2$ premiers termes, la seule contrainte est qu'il n'y ait pas deux 1 consécutifs. Il y a donc $u_{n-2}$ telles listes.ou bien elle se termine par un 0. Il n'y a pas de contraintes sur les $n-1$ premiers termes, si ce n'est qu'il ne faut pas qu'il y ait deux 1 consécutifs. Il y a donc $u_{n-1}$ telles listes.On a donc réalisé une partition des listes à $n$ termes ne comportant pas deux $1$ consécutifs, et $u_n=u_{n-1}+u_{n-2}$.Variables :U entierV entierW entierN entierTraitement2->U3->VPour N allant de 3 à 20 faireU+V->WV->UW->VFin PourAfficher VOn peut associer à chaque questionnaire une liste de 0 et de 1, le $i$-ème terme vaut 1 si la réponse est juste, et 0 si la réponse est fausse. L'énoncé nous dit que les 17712 listes obtenues ne comportent deux termes 1 consécutifs. Or, il y a $u_{20}=17711$ telles listes différentes. Deux des listes doivent donc être identiques, et il y a bien deux candidats qui ont répondu de la même manière aux questions.",
    "lang": "french"
}