{
    "script": "Un sac contient 5 jetons blancs et 8 jetons noirs. On suppose que les jetons sont discernables (numérotés par exemple) et on effectue un tirage de 6 jetons de ce sac.On suppose que les jetons sont tirés successivement en remettant à chaque fois le jeton tiré.Donner le nombre de résultats possibles.Combien de ces résultats amènentexactement 1 jeton noir ?au moins 1 jeton noir ?au plus un jeton noir ?2 fois plus de jetons noirs que de jetons blancs ?Mêmes questions en supposant que les jetons sont tirés successivement sans remise.Mêmes questions en supposant que les jetons sont tirés simultanément.",
    "hint": "",
    "solution": "On est dans un cas où l’ordre et la répétition interviennent puisque les jetons sont tirés successivement et avec remise. A chaque tirage, on a $13$ choix possibles, et donc on obtient $13^6$ résultats possibles (on a dénombré des listes).Pour obtenir exactement un jeton noir, on doit choisir à quel tirage on va tirer le jeton noir (6 choix possibles). Ensuite pour chaque choix de numéro de tirage, on a 8 choix possibles de jetons noirs et pour les 5 autres tirages, on a 5 possibilités à chaque fois puisqu'il y a 5 jetons blancs. Ainsi, on obtient : $6 \\times  8 \\times  5^5$ résultats possibles.On va dénombrer l’ensemble complémentaire. En effet, il y a exactement $5^6$ tirages sans jeton noir (à chaque fois, on a tiré un jeton blanc). \r\nIl y a donc $13^6-5^6$ tirages avec au moins un jeton noir.On a déjà dénombré les tirages avec exactement un jeton noir et les tirages sans jeton noir. L'ensemble recherché étant l'union disjointe des ensembles précédents, il y a $6 \\times  8 \\times  5^5+5^6$ tirages amenant au plus un jeton noir.Si on a deux fois plus de jetons noirs que de jetons blancs, c'est qu'on a tiré 4 jetons noirs et 2 jetons blancs. On commence par fixer les 2 tirages parmi 6 pour lesquels on a trouvé un jeton blanc : il y en a $\\binom 62$. \r\nCe choix fixé, il y a $5^2$ choix pour les jetons blancs et $8^4$ choix possibles pour les jetons noirs. On obtient au final $\\binom 62\\times 5^2\\times 8^4$ tirages amenant 2 fois plus de jetons noirs que de jetons blancs.Si on tire les jetons successivement et sans remise, l'ordre intervient mais il n'y a plus de répétition. On dénombre des arrangements et il y a $13\\times 12\\times 11\\times 10\\times 9\\times 8=13!/7!$ tirages possibles.Pour obtenir exactement un jeton noir, on doit choisir à quel tirage on va tirer le jeton noir (6 choix possibles). Ensuite pour chaque choix de numéro de tirage, on a 8 choix possibles de jetons noirs et pour les 5 autres tirages, on doit choisir 5 jetons parmi 5 sans remise mais avec ordre : $5 \\times  4 \\times  3 \\times  2 \\times  1 = 5!$. Ainsi, on obtient $6 \\times  8 \\times  5!$\r\nrésultats possibles.On remarque qu'il n'y a aucun tirage sans jeton noir, puisque l'on fait 6 tirages, sans remise, et qu'il n'y a que 5 jetons blancs. Le nombre de tirages avec au moins un jeton noir est égal au nombre total de tirages, soit $13!/7!$.Comme il n'y a aucun tirage sans jeton noir, le nombre de tirages avec au plus un jeton noir est égal au nombre de tirages avec exactement un jeton noir, soit $6 \\times  8 \\times  5!$ résultats possibles.Comme précédemment, on tire 2 jetons blancs et 4 jetons noirs. On commence par fixer la place des 2 jetons blancs parmi les 6 tirages, il y a $\\binom 6 2$ choix. Puis il y a $5\\times 4$ choix pour les jetons blancs et $8\\times 7\\times 6\\times 5$ choix possibles pour les jetons noirs. Finalement, on obtient $\\binom 62\\times 5\\times 4\\times 8\\times 7\\times 6\\times 5$ choix possibles.On est dans le cas où ni l'ordre ni la répétition n'interviennent, on dénombre donc des combinaisons. Il y a donc $\\binom{13}6$ résultats possibles.On tire forcément tous les jetons blancs et un jeton noir parmi les 8 : il y a donc 8 tirages possibles.On remarque qu'il n'y a aucun tirage sans jeton noir, puisque l'on fait 6 tirages, sans remise, et qu'il n'y a que 5 jetons blancs. Le nombre de tirages avec au moins un jeton noir est égal au nombre total de tirages, soit $\\binom{13}6$.Comme il n'y a aucun tirage sans jeton noir, le nombre de tirages avec au plus un jeton noir est égal au nombre de tirages avec exactement un jeton noir, soit $8$ résultats possibles.On doit tirer 2 jetons blancs parmi 5 et 4 jetons noirs parmi 8. Le nombre de tirages recherché est donc $\\binom 52\\times \\binom 84$.",
    "lang": "french"
}