{
    "script": "Dans cet exercice, on attend des réponses qui ne sont pas des valeurs numériques, mais des expressions en termes de factorielles, sous la forme\r\nla plus simple possible.Combien y-a-t-il de façons de répartir les 52 cartes d'un jeu entre 4 joueurs N, S, E, O, chacun possédant 13 cartes.Parmi ces façons, combien y-en-a-t-il qui sont telles que chaque joueur n'a qu'une seule couleur (par exemple, N a les 13 piques, S a les 13 coeurs,...)?Combien y-a-t-il de façons que deux joueurs quelconques aient chacun une seule couleur?Combien y-a-t-il de façons que deux partenaires, c'est-à-dire (N,S) ou (E,O), aient chacun une seule couleur, les deux autres partenaires ayant des cartes quelconques.",
    "hint": "Compter le nombre de choix possibles pour le premier joueur, puis pour le deuxième...Choisir une couleur parmi 4 pour N, puis une couleur parmi...Choisir d'abord les deux joueurs qui ont une seule couleur, puis choisir pour chaque joueur la couleur.Raisonner de la même façon.",
    "solution": "Il y a $\\binom{52}{13}$ choix possibles pour le premier joueur, puis $\\binom{52-13}{13}=\\binom{39}{13}$ choix possibles pour le deuxième joueur,\r\n et encore $\\binom{39-13}{13}=\\binom{26}{13}$ pour le troisième. Le dernier joueur prend les 13 cartes restantes. Au total on trouve\r\n $$\\binom{52}{13}\\times\\binom{39}{13}\\times\\binom{26}{13}=\\frac{52!}{39!13!}\\times\\frac{39!}{26!13!}\\times \\frac{26!}{13!\\times 13!}=\\frac{52!}{(13!)^4}.$$On choisit une couleur parmi 4 pour le premier joueur, puis une couleur parmi 3 pour le deuxième et enfin une couleur parmi 2 pour le troisième. Cela fait $4!$ possibilités.\r\n On peut aussi argumenter à l'aide du nombre de permutation de 4 couleurs.On commence par choisir les deux joueurs qui ont la même couleur. Il y a $\\binom 42$ tels choix. On choisit ensuite une couleur parmi 4 pour le premier joueur, et une couleur parmi 3 pour le deuxième\r\n joueur. Il reste pour le 3ème joueur à choisir 13 cartes parmi les 26 restantes tandis que le quatrième prend le reste. On trouve donc :\r\n $$ \\frac{4\\times 3}{2}\\times 4\\times 3\\times\\binom{26}{13}=\\frac{72\\times (26)!}{(13!)^2}.$$\r\nMais ce faisant, on a compté trop les tirages où les 4 joueurs ont une seule couleur : en effet, un tel tirage est compté $\\binom 4 2$ fois, puisqu'on a choisit deux joueurs qui avaient la même couleur et que cela n'a pas lieu d'être dans ce cas là puisque tous les joueurs ont la même couleur.\r\n Il faut donc retirer $\\left(\\binom 4 2-1\\right)4!$ et le résultat final est :\r\n $$ \\frac{4\\times 3}{2}\\times 4\\times 3\\times\\binom{26}{13}-\\left(\\binom 4 2-1\\right)4!=\\frac{72\\times (26)!}{(13!)^2}-5\\times 4!.$$Le dénombrement à réaliser est très similaire, mais il y a moins de choix pour choisir les deux joueurs qui ont la même couleur puisqu'on ne choisit plus deux joueurs quelconques,\r\n mais deux partenaires. Il n'y a donc que $2$ choix au lieu de $\\binom 42$. Finalement, on trouve $\\frac{24\\times (26)!}{(13!)^2}-4!.$",
    "lang": "french"
}