{
    "script": "Les grilles tournantes, mises au point par le colonel Fleissner, servirent pour  une méthode de cryptographie qui fut utilisée par les allemands\r\nlors de la Première Guerre Mondiale. Une telle grille est constituée par un carré de côté 6. On divise ce carré en une grille de 36 petits carrés égaux\r\n(tous de côté 1), et on ôte 9 de ces carrés. La propriété suivante doit être vérifiée : les trous que l'on obtient avec la grille en position initiale,\r\navec la grille tournée d'un quart de tour, d'un demi-tour ou de trois quart de tour ne se superposent jamais. Ainsi, les 36 positions peuvent être occupées par un trou après éventuellement une rotation de la grille d'un quart, d'un demi ou de trois-quart de tour.Combien peut-on fabriquer de telles grilles?Pour quelles valeurs de $n$ peut-on fabriquer une grille de Fleissner de côté $n$? Combien de telles grilles peut-on alors fabriquer?",
    "hint": "On a 36 choix pour le premier trou. Et combien pour le second?Il faut effectuer $n^2/4$ trous...",
    "solution": "On a 36=4*9 choix pour placer le premier trou. On ne peut ensuite plus choisir ni ce carré, ni les 3 carrés obtenus à partir de celui-ci par rotation.\r\nIl reste donc 32=4*8 choix pour placer le second trou. On a ensuite 4*7 choix pour placer le troisième trou, et ainsi de suite... jusque 4 choix pour placer le 9ème trou.\r\nMais attention! Ce faisant, on compte certaines grilles deux fois. En effet, on obtient la même grille si on échange le premier trou et le deuxième trou....\r\nIl faut diviser donc le total obtenu par le nombre de permutations possibles entre les 9 trous, soit 9! Finalement, le nombre de grilles possibles est\r\n$$\\frac{4\\times 9\\times 4\\times 8\\times 4\\times 7\\times\\dots\\times 4\\times 1}{9!}=4^9.$$Si on veut construire une grille de Fleissner, il faut pouvoir réaliser $n^2/4$ trous (pour qu'avec les 4 positions, on puisse obtenir $n^2$ trous).\r\nAinsi, $n$ doit être pair (et dans ce cas, $n^2$ est bien un multiple de 4). Ensuite, on procède comme dans le cas précédent : on a $n^2=4\\times\\frac{n^2}{4}$ choix pour le premier carré, $n^2-4=4\\times \\left(\\frac{n^2}4-1\\right)$ choix pour le deuxième carré,... En n'oubliant pas de diviser par la factorielle de $\\frac{n^2}4$, \r\non obtient que le nombre de grilles est $4^{n^2/4}$.",
    "lang": "french"
}