{
    "script": "On tire simultanément 5 cartes d'un jeu de 32 cartes. Combien de tirages différents peut-on obtenir :sans imposer de contraintes sur les cartes.contenant 5 carreaux ou 5 piques.contenant 2 carreaux et 3 piques.contenant au moins un roi.contenant au plus un roi.contenant exactement 2 rois et exactement 3 piques.",
    "hint": "Il faut choisir une partie à 5 élements dans un ensemble à 32 éléments.Compter séparément le nombre de tirages comprenant 5 carreaux et 5 piques.Choisir les carreaux, puis les piques.Compter les tirages sans roi, et retirer du nombre total.Compter les tirages sans roi, puis ceux avec exactement un roi.Séparer les tirages contenant le roi de pique, et ceux ne contenant pas le roi de pique.",
    "solution": "Il n'y a pas d'ordre et pas de répétition sur les cartes : un tirage est donc une combinaison de 5 cartes parmi 32. Il y a : $\\binom{32}5=201376$ tirages différents.Pour obtenir 5 carreaux, il faut choisir 5 cartes parmi 8 : il y a $\\binom85$ tels tirages. De même pour obtenir 5 piques. Comme les deux cas sont disjoints, il y a $2\\times \\binom85=112$ tels tirages différents.Il y a $\\binom82$ façons de choisir 2 carreaux parmi 8 puis, pour chacune de ces façons, il y a $\\binom83$ façons de choisir 3 piques. Le nombre de tirages recherché est donc : $\\binom82\\times \\binom83=1568$.On compte le complémentaire, c'est-à-dire les tirages sans rois : il faut alors choisir 5 cartes parmi 28, il y a $\\binom{28}5$ tels tirages. Le nombre de tirages recherché est donc : $\\binom{32}5-\\binom{28}5=103096$.On a déjà compté les tirages sans roi. Pour les tirages comprenant exactement un roi, il y a 4 façons de choisir le roi, puis, pour chacune de ces façons, $\\binom{28}4$ façons de choisir les autres cartes. On en déduit qu'il y a $\\binom{28}5+4\\binom{28}{4}=180180$ tels tirages.On sépare les tirages contenant le roi de pique et ceux ne contenant pas le roi de pique.si le tirage ne contient pas le roi de pique, il y a $\\binom32$ choix différents de 2 rois parmi 3, puis $\\binom73$ choix de 3 piques parmi 7 (tous sauf le roi de pique).si le tirage contient le roi de pique, il reste 3 choix pour le roi différent du roi de pique, puis $\\binom{7}2$ choix pour les deux autres piques. Cela faisant, on n'a tiré que 4 cartes. Il reste une carte à choisir qui n'est ni un roi, ni un pique, et donc $32-(4+7)=21$ choix (attention à ne pas compter à nouveau deux fois le roi de pique!).Finalement, le nombre de tirages possibles est :\r\n$$\\binom32\\times \\binom73+3\\times \\binom{7}2\\times 21=1428.$$",
    "lang": "french"
}