{
    "script": "Une entreprise spécialiste dans la fabrication de plateaux pour des tables utilise une machine qui débite des planches de 2 mètres de longueur. Une étude statistique sur un très grand nombre de plateaux usinés montre que la probabilité que le plateau comporte un défaut, et donc qu'il ne soit pas utilisé pour la fabrication d'une table, est égale à 0,012. Des contrôles qualité sont effectués sur des échantillons de 500 plateaux et un réglage de la machine pourrait être prévu si les défauts observés sont trop nombreux.Un technicien, qui a observé 10 plateaux présentant un défaut sur un échantillon de 500 plateaux (c'est à dire une proportion de 2\\% de plateaux défectueux) \r\n et qui se souvient de ce qu'il a appris en classe de première produit la feuille Excel suivante.Doit-il envisager d'effectuer un réglage de la machine ? Expliquer proprement son raisonnement. Quel est le niveau de confiance exact de sa décision ?Le technicien veut s'assurer qu'il a pris la bonne décision. Il s'adresse à son collègue pour lui demander une vérification. Celui-ci n'a pas de tableur à sa disposition, mais se souvient de ce qu'il a appris en classe de terminale. Au bout de quelques minutes, après avoir construit un intervalle de fluctuation asymptotique au seuil de 95\\% et vérifié que les conditions étaient réunies pour utiliser cet intervalle en vue d'une prise de décision, il confirme à son collègue que la décision qu'il a prise était la bonne. Quel a été son raisonnement ?Les deux techniciens ont de sérieux doutes sur le réglage de la machine et vont chercher à effectuer le contrôle sur un échantillon plus important. Ils construisent alors la feuille de tableur suivante qui permet de déterminer l'intervalle de fluctuation asymptotique au seuil de 95\\% pour différentes valeurs de la taille $n$ de l'échantillon prélevé.Que cherchent-ils à détecter dans la colonne D ?Quelles formules ont-ils saisies dans les cellules B69 et C69 ?Quelle conclusion peuvent-ils tirer de ce tableau ?A l'aide d'un calcul, proposer une conclusion plus précise que celle obtenue à la question précédente.",
    "hint": "",
    "solution": "Soit $X$ la variable aléatoire égale au nombre de plateaux défectueux. Alors $X$ suit une loi binomiale de paramètres 500 et 0,012. On cherche à construire un intervalle de fluctuation à 95\\% associé, et le tableau nous le permet. Soit en effet$a$ le plus petit entier $k$ tel que $P(X\\leq k)>0,025$. Ici, $a=2$.$b$ ke plus petit entier $k$ tel que $P(X\\leq k)\\geq 0,975$. Ici, $b=11$.Alors l'intervalle $[2/500,11/500]$ est un intervalle de fluctuation au seuil de 95\\% de $X$. Ici, on a $0,02=2/100$ qui appartient à cette intervalle. Il n'y a donc pas lieu de s'inquiéter. Le seuil de confiance exact est égal à $B12-B2$ soit environ 96,4\\%. Ceci signifie qu'il y a environ 96,4\\% de chances que le nombre de plateaux défectueux soit compris entre 2 et 11.L'intervalle de fluctuation asymptotique est donné par \r\n$$\\left[p-1,96\\frac{\\sqrt{p(1-p)}}{\\sqrt n};p+1,96\\frac{\\sqrt{p(1-p)}}{\\sqrt n}\\right]$$\r\noù dans notre cas $p=0,012$ et $n=500$. L'intervalle trouvé est donc à peu près $[0,00246;0,021544]$. La proportion de plateaux défectueux, 0,02, est dans cet intervalle. Il n'y a donc pas lieu de s'inquiéter.Ils cherchent à déterminer la taille de l'échantillon à partir de laquelle, si on trouve une proportion de 2\\% de plateaux défectueux, on doit procéder à un nouveau réglage de la machine.Dans $B69$, on rentre la formule\r\n$$=0,012-1,96*RACINE(0,012*(1-0,012)/A69)$$\r\nIdem dans $C69$ avec un $+$.C'est à partir d'un échantillon compris entre 710 et 720 plateaux que, si l'on trouve une proportion de 2\\% de plateaux défectueux, on sort de l'intervalle de fluctuation asymptotique.On cherche la plus petite valeur de $n$ tel que $0,02$ sorte de l'intervalle de fluctuation asymptotique, c'est-à-dire la plus petite valeur de $n$ tel que \r\n$$p+1,96\\frac{\\sqrt{p(1-p)}}{\\sqrt n}\\leq 0,02.$$\r\nAprès un petit calcul, et remplaçant $p$ par $0,012$, on trouve $n\\geq 711,65$. C'est donc à partir d'un échantillon d'exactement 712 plateaux que l'on sort de l'intervalle de fluctuation asymptotique.",
    "lang": "french"
}