{
    "script": "Le théorème fondamental du calcul intégral est le résultat suivant :Si $f$ est une fonction continue sur un intervalle $[a,b]$, et si, pour tout $x\\in [a,b]$, on pose\r\n$$F(x)=\\int_a^x f(t)dt,$$\r\nalors $F$ est dérivable sur $[a,b]$ et $F'(x)=f(x)$ pour tout $x\\in [a,b]$.Pourquoi ce théorème est fondamental???Dans le programme de Terminale S, il est écrit dans les commentaires \"Il est intéressant de présenter le principe de la démonstration du théorème dans le cas où $f$ est positive et croissante\". Faire cette démonstration. En quoi les hypothèses $f$ positive et $f$ croissante sont utiles? Pourrait-on s'en passer (au niveau Terminale S)?Regarder la preuve de ce théorème dans votre cours de licence, ou dans un livre de math sup. Quel argument fait que l'on ne peut pas prouver le cas général en Terminale S?",
    "hint": "Calculer le taux d'accroissement de $F$ en $x_0$.",
    "solution": "Ce théorème est fondamental, car il fait le lien entre la notion d'intégrale et la notion de primitive. C'est lui qui permet d'affirmer que toute fonction continue admet des primitives, et que le calcul intégral est l'opération contraire (réciproque) de la dérivation.On va calculer le taux d'accroissement de $F$ en $x_0$. Soit $h>0$. Alors \r\n$$\\frac{F(x_0+h)-F(x_0)}h=\\frac 1h\\int_{x_0}^{x_0+h}f(t)dt.$$\r\nLa fonction $f$ étant positive, cette dernière intégrale est égale à l'aire sous la courbe de la fonction $f$ entre les droites $x=x_0$ et $x=x_0+h$. La fonction $f$ étant croissante, cette aire est plus grande que l'aire du rectangle délimité par les droites $x=x_0$, $x=x_0+h$, $y=0$ et $y=f(x_0)$. On a ainsi\r\n$$hf(x_0)\\leq \\int_{x_0}^{x_0+h}f(t)dt.$$\r\nOn peut aussi majorer l'aire sous la courbe par l'aire d'un autre rectangle, en remplaçant la droite $y=f(x_0)$ par la droite $y=f(x_0+h)$. On obtient alors\r\n$$\\int_{x_0}^{x_0+h}f(t)dt\\leq hf(x_0+h).$$\r\nFinalement, divisant par $h>0$, on a l'encadrement\r\n$$f(x_0)\\leq \\frac{F(x_0+h)-F(x_0)}h\\leq f(x_0+h).$$\r\nOn fait alors tendre $h$ vers $0$ et on obtient que\r\n$$\\lim_{h\\to 0^+}\\frac{F(x_0+h)-F(x_0)}h=f(x_0)$$\r\ncar $f$ est continue en $x_0$. On procède de la même façon si $h<0$ (en faisant attention au sens des inégalités!).L'hypothèse $f$ positive sert à interpréter l'intégrale comme une aire sous la courbe. L'hypothèse $f$ croissante sert à encadrer l'intégrale par deux quantités faciles. On pourrait se passer de l'hypothèse $f$ positive si on n'utilise pas l'interprétation géométrique, mais si on majore directement en utilisant la positivité de l'intégrale : pour tout $x\\in [x_0,x_0+h]$, on a $f(x)\\geq f(x_0)$ et si on intègre cette inégalité entre $x_0$ et $x_0+h$, on obtient l'inégalité obtenue ci-dessus.Si on veut faire cette preuve sans hypothèse supplémentaire, on est conduit à \"mettre les mains dans le cambouis\" et à utiliser la définition de la continuité avec des quantificateurs. Fixons $\\veps>0$. Il existe $\\eta>0$ tel que, si $x\\in [x_0-\\eta,x_0+\\eta]$, alors $f(x_0)-\\veps\\leq f(x)\\leq f(x_0)+\\veps$. Mais alors, si $|h|<\\eta$ (avec par exemple $h>0$), on a pour tout $t\\in [x_0,x_0+h]$, \r\n$f(x_0)-\\veps\\leq f(t)\\leq f(x_0)+\\veps$. Si on intègre cette inégalité entre $x_0$ et $x_0+h$ et que l'on divise par $h$, alors on trouve que \r\n$$f(x_0)-\\veps\\leq \\frac{F(x_0+h)-F(x_0)}h\\leq f(x_0)+\\veps.$$\r\nOn vient d'écrire avec des quantificateurs que le taux d'accroissement $\\frac{F(x_0+h)-F(x_0)}h$ tend vers $f(x_0)$ si $h$ tend vers 0, exactement ce que l'on voulait.",
    "lang": "french"
}