{
    "script": "Soit $\\mathcal E$ l'ellipse d'équation \r\n$$\\frac{x^2}{a^2}+\\frac{y^2}{b^2}=1.$$Soit $m$ un réel. Déterminer les droites de coefficient directeur $m$ qui sont tangentes \r\nà $\\mathcal E$.A quelle condition les droites $y=mx+p$ et $y=m'x+p'$ sont elles perpendiculaires?En déduire que le lieu des points du plan par lesquels passent deux tangentes à $\\mathcal E$ qui\r\nsont perpendiculaires est un cercle dont on précisera le centre et le rayon.",
    "hint": "Écrire $y=mx+p$ une équation de droite et chercher ses points d'intersection avec\r\nl'ellipse. Il doit y en avoir exactement 1 pour que la droite soit tangente.C'est du cours.Considérer deux droites perpendiculaires tangentes à l'ellipse, et chercher leurs points d'intersection.",
    "solution": "Soit $y=mx+p$ une telle droite. On cherche les points d'intersection de cette droite avec l'ellipse $\\mathcal E$.\r\nPour cela, on introduit cette relation dans l'équation de l'ellipse, et on trouve\r\n$$\\frac{x^2}{a^2}+\\frac{m^2x^2+2mpx+p^2}{b^2}=1\\iff (b^2+a^2m^2)x^2+2a^2mpx+(a^2p^2-a^2b^2)=0.$$\r\nPour que la droite soit tangente, cette équation doit avoir une unique solution, et donc son discriminant doit être\r\nnul. On trouve\r\n\\begin{eqnarray*}\r\n\\Delta'&=&a^4m^2p^2-(a^2p^2-a^2b^2)(b^2+a^2m^2)\\\\\r\n&=&-a^2p^2b^2+a^2b^4-a^4n^2b^2\r\n\\end{eqnarray*}\r\net ceci est nul si et seulement si \r\n$$p=\\pm \\sqrt{a^2m^2+b^2}.$$C'est du cours. C'est vrai si et seulement si $mm'=-1$ (ce qui peut se retrouver en écrivant un vecteur directeur\r\nde chaque droite et en écrivant qu'ils doivent être orthogonaux).Soit\r\n\\begin{eqnarray*}\r\ny&=&mx\\pm\\sqrt{b^2+a^2m^2}\\\\\r\ny&=&-\\frac{x}{m}\\pm\\sqrt{\\frac{a^2}{m^2}+b^2}\r\n\\end{eqnarray*}\r\ndeux droites tangentes à l'ellipse qui sont orthogonales. On cherche leur point d'intersection. En mettant les équations au carré, on trouve\r\n\\begin{eqnarray*}\r\n(y-mx)^2&=&b^2+a^2m^2\\\\\r\n(mx+y)^2&=&a^2+b^2m^2.\r\n\\end{eqnarray*}\r\nEn sommant ces égalités, on trouve\r\n$$(m^2+1)x^2+(m^2+1)y^2=(m^2+1)(a^2+b^2)$$\r\net donc le point d'intersection est nécessairement sur le cercle d'équation\r\n$$x^2+y^2=a^2+b^2.$$\r\nRéciproquement, tout point de cercle convient, il suffit de le vérifier (mais c'est un peu pénible...).",
    "lang": "french"
}