{
    "script": "Un cycliste parcourt 30 km en une heure. Démontrer qu'il existe un intervalle de temps de 10 minutes tel\r\nque le cycliste a parcouru 5 km. Existe-t-il toujours un intervalle de temps de 40 minutes durant lequel il aura parcouru 20km?",
    "hint": "Soit $f$ la fonction qui représente la distance parcourue par le cycliste en fonction du temps. Quelle propriété veut-on prouver sur $f$?",
    "solution": "Notons $f$ la fonction qui représente la distance parcourue par le cycliste en fonction du temps (exprimé en minutes). $f$ est une fonction continue, $f(0)=0$ et $f(60)=30$. On veut prouver qu'il existe un intervalle de temps de 10 minutes tel que le cycliste a parcouru 5 km. Autrement dit, on veut trouver $x$ dans $[0,50]$ tel que $f(x+10)-f(x)=5$. Supposons qu'un tel $x$ n'existe pas. Par le théorème des valeurs intermédiaires, on sait alors que :ou bien, pour tout $x\\in [0,50]$, on a $f(x+10)-f(x)>5$.ou bien, pour tout $x\\in [0,50]$, on a $f(x+10)-f(x)<5$.Dans le premier cas, on a \r\n\\begin{eqnarray*}\r\nf(60)&=&f(60)-f(50)+f(50)-f(40)+f(40)-f(30)+f(30)-f(20)+f(20)-f(10)+f(10)-f(0)\\\\\r\n&>&6\\times 5\\\\\r\n&>&30.\r\n\\end{eqnarray*}\r\nce qui est une contradiction. Dans le second cas, on trouverait $f(60)<30$, ce qui constitue également une contradiction. L'hypothèse formulée est donc fausse : il existe $x\\in [0,50]$ tel que $f(x+10)-f(x)=5$.Dans un intervalle de 40 minutes, cela devient faux. Supposons par exemple que le cycliste parcourt 15 kms pendant les 10 premières minutes, se repose pendant 40 minutes, puis parcourt les 15 derniers kilomètres pendant les 10 dernières minutes. Alors, si on prend un intervalle de temps de 40 minutes :ou bien il contient une partie des 10 premières minutes, mais alors il ne comprend aucune partie des 10 dernières minutes, et dans ce cas la distance parcourue est inférieure à 15km.ou bien il contient une partie des 10 dernières minutes, mais alors il ne comprend aucune partie des 10 premières minutes, et dans ce cas la distance parcourue est inférieure à 15km.ou bien c'est l'intervalle \"central\", et dans ce cas la distance parcourue est nulle.Dans tous les cas, on ne peut pas trouver d'intervalle de temps de 40 minutes durant lequel il aura parcouru 20km.",
    "lang": "french"
}