{
    "script": "On injecte un médicament à un patient en intraveineuse.\r\nDans de nombreux cas, la concentration dans le sang de la substance active, en $\\textrm{mg.L}^{-1}$, vérifie la relation \r\n$$C(t)=C_0e^{-\\lambda t}$$\r\noù $C_0$ est la concentration initiale, $t$ est le temps, exprimé en heures, après l'injection, et $\\lambda$ est un coefficient spécifique au médicament,On appelle demi-vie du médicament le temps nécessaire pour que, après administration du médicament, sa concentration diminue de moitié. Calculer (en fonction de $\\lambda$) le temps de demi-vie $T_{1/2}$ d'un médicament dont la concentration dans le sang satisfait la relation précédente. Quelle est la concentration après $2T_{1/2}$? Après $nT_{1/2}$?L'aztréonam est un antibiotique qui est notamment utilisé chez les patients atteints de mucoviscidose pour soigner des infections bronchiques. Il n'est efficace que si sa concentration dans \r\nle sang dépasse $49\\textrm{mg.L}^{-1}$. On dispose de doses de $2\\textrm{g}$ et on souhaite connaitre le temps maximal entre deux injections pour maintenir cette concentration supérieure à $49\\textrm{mg.L}^{-1}$ chez un patient pesant $60\\textrm{kg}$. \r\nSachant que le volume sanguin d'un adulte est d'environ $70\\textrm{mL.kg}^{-1}$ et que le temps de demi-vie de l'aztréonam, tel qu'indiqué par le fabricant, est de $1,\\!7\\textrm{h}$,  calculerle temps maximal séparant la première injection et la deuxième;le temps maximal séparant les injections suivantes",
    "hint": "Lorsqu'on réalise la deuxième injection, on ne repart plus de zéro!",
    "solution": "De la relation $C_0e^{-\\lambda T_{1/2}}=C_0/2$, on tire $T_{1/2}=\\frac{\\ln 2}{\\lambda}$.On commence par calculer le coefficient $\\lambda$ de l'aztréonam. En utilisant la relation précédente, on trouve $\\lambda=\\frac{\\ln 2}{T_{1/2}}\\simeq 0,\\!4 $.\r\nLe volume sanguin du patient est égal à $60\\times 0,\\!07=4,\\!2 \\textrm{L}$. Chaque injection de $2\\textrm{g}$ correspond donc à une augmentation de la concentration de $2000/4,\\!2=476\\textrm{mg.L}^{-1}$. Pour la première injection, on a $C_0=476$ et on cherche $T_1$ tel que\r\n$476e^{-0,\\!4 T_1}=49$ soit \r\n$$T_1=-\\frac{\\ln\\left(\\frac{49}{476}\\right)}{0,\\!4}\\simeq 5,\\!68\\textrm{h}.$$Lorsqu'on réalise la deuxième injection, et de même pour les suivantes, la concentration du médicament est cette fois au moins de $49+476=525$. On cherche donc cette fois $T_2$ tel que \r\n$525e^{-0,\\!4 T_2}=49$, soit \r\n$$T_1=-\\frac{\\ln\\left(\\frac{49}{525}\\right)}{0,\\!4}\\simeq 5,\\!92\\textrm{h}.$$",
    "lang": "french"
}