{
    "script": "On considère la courbe de la fonction exponentielle dans un repère orthonormé $(O,\\vec i,\\vec j)$.Pour $x\\in\\mathbb R$, on pose $g(x)=x+e^{2x}$. Démontrer qu'il existe un réel $c$ tel que $g(x)< 0$ si $x< c$ et $g(x)> 0$ si $x> c$.En déduire qu'il y a un unique point sur la courbe de la fonction exponentielle qui minimise la distance à l'origine. On le note $M_0$.Démontrer que la tangente à la courbe en $M_0$ est perpendiculaire à la droite $(OM_0)$.",
    "hint": "Étudier les variations de $g$.Soit $(x,e^x)$ un point de la courbe. Quelle est sa distance à l'origine au carré?Montrer l'orthogonalité des vecteurs directeurs.",
    "solution": "La fonction $g$ est dérivable et sa dérivée est $g'(x)=1+2e^{2x}$ qui est strictement positive. Ainsi, $g$ est strictement croissante. De plus, $\\lim_{x\\to-\\infty}g(x)=-\\infty$ et $g(0)=1>0$. D'après le théorème des valeurs intermédiaires, que l'on peut bien appliquer puisque $g$ est continue, il existe $c\\in]-\\infty,0[$ tel que $g(c)=0$. La stricte croissance de $g$ assure que $g(x)< 0$ si $x< c$ et $g(x)>0$ si $x> c$. Remarquons qu'il n'était pas besoin de dériver $g$ pour démontrer que cette fonction est strictement croissante. On aurait aussi pu remarquer que c'est la somme de deux fonctions strictement croissantes.Minimiser la distance d'un point à l'origine ou minimiser le carré de la distance à l'origine est le même problème. Soit $(x,e^x)$ un point de la courbe. Le carré de sa distance à l'origine est donné par \r\n$$f(x)=x^2+e^{2x}.$$\r\nIl s'agit de démontrer que cette fonction admet un unique minimum. $f$ est dérivable et sa dérivée est donnée par la fonction $2g$. D'après la question précédente, $f$ est strictement décroissante sur l'intervalle $]-\\infty,c[$ et strictement croissante sur $]c,+\\infty[$. Ainsi, il y a un unique point de la courbe minimisant la distance à l'origine, le point $(c,\\exp(c))$.La droite $(OM_0)$ a pour vecteur directeur $(c,\\exp(c))$. La tangente à la courbe en $M_0$ a pour vecteur directeur $(1,\\exp'(c))=(1,\\exp(c))$. Les deux droites sont perpendiculaires si et seulement si leurs vecteurs directeurs sont orthogonaux. On calcule donc leur produit scalaire qui vaut\r\n$$c+\\exp(2c)=g(c)=0.$$",
    "lang": "french"
}