{
    "script": "{\\bf Restitution de connaissances.}Soit $Z$ une variable aléatoire qui suit une loi normale ${\\mathcal N}(m,\\sigma^2)$. Donner une valeur approchée à $10^{-2}$ près de  $$P(m-2\\sigma\\le Z\\le m+2\\sigma)\\ ?$$Soit $N$ une variable aléatoire de loi normale centrée réduite. Donner une valeur approchée à $10^{-2}$ près du réel $a$ tel que $$P(-a\\le N\\le a)=99\\%\\ .$$Au sortir d'un laminoir, un lingot est découpé en billettes de 6 mètres de longueur. On sait que la tête du lingot présente un défaut sur une longueur $X$, où $X$ est une variable aléatoire qui suit une loi normale ${\\mathcal N}(8,4)$. Pour tenter d'éliminer la longueur défectueuse, on détruit systématiquement les deux billettes de tête.Quel est le risque pour que la troisième billette présente encore un défaut ?Calculer le nombre de billettes à détruire pour que la première billette retenue soit sans défaut avec une probabilité d'au moins 99\\%.",
    "hint": "Ce sont des valeurs du cours ou alors utiliser une table de la loi normale.La troisième billette présente un défaut si et seulement si $X>12$. Il faut donc calculer $P(X>12)$.La",
    "solution": "Ce sont des valeurs à connaitre. On peut aussi s'aider d'une table de la loi normale. On a alors$$P(m-2\\sigma\\le Z\\le m+2\\sigma)=P(-2\\leq N\\leq 2)\\approx 95\\%\\ .$$$$P(-2,58\\le N\\le 2,58)\\approx 99\\%\\ .$$La longueur de 2 billettes vaut 12 mètres. On cherche donc à calculer $P(X>12)$. Ici, $X$ suit une loi ${\\mathcal N}(m,\\sigma^2)$ avec $m=8$ et $\\sigma=2$. Ainsi, $12=m+2\\sigma$. Donc\r\n\\begin{eqnarray*}\r\nP(X>12)&=&P(X>m+2\\sigma)=\\frac{1}2\\big(P(X>m+2\\sigma)+P(X<m-2\\sigma)\\big)\\\\\r\n&=&\\frac12\\big(1-P(m-2\\sigma\\leq X\\leq m+2\\sigma)\\big)\\approx 2,5\\%\\ .\r\n\\end{eqnarray*}Il est clair par la question précédente que détruire les deux premières billettes ne suffit pas. Voyons qu'il suffit de détruire 3 billettes. La longueur de 3 billettes vaut 18 mètres et $18=m+5\\sigma$. On a\r\n$$P[X>m+5\\sigma]< P(X>m+2,58\\sigma)\\approx0,05\\%<1\\%\\ .$$\r\nDonc, si on détruit les trois premères billette, la probabilité qu'il reste des défauts dans la première billette retenue est inférieure à 1\\%. En fait un calcul précis (obtenu avec GeoGebra ou une table de la loi normale) nous donne\r\n$$P[X>18]\\approx 2,87\\times 10^{-7}\\ .$$\r\nIl y a vraiment un risque infime qu'en détruisant les trois premières billettes, la quatrième présente encore un défaut! Remarquons aussi que la modélisation introduite dans cet exercice n'est pas très réaliste. En effet, puisque $X$ suit une loi normale, $X$ peut prendre des valeurs négatives (mais avec probabilité tellement faible que c'est sans réelle importance pour la réalité).",
    "lang": "french"
}