{
    "script": "Une entreprise d'autocars dessert une région montagneuse. En chemin, les véhicules peuvent être bloqués par des incidents extérieurs comme des pierres, la présence de troupeaux sur la route. Un autocar part de son entrepôt. On note $D$ la variable aléatoire qui mesure la distance, en kilomètres, que l'autocar va parcourir jusqu'à ce que survienne un incident. On admet que $D$ suit une loi exponentielle de paramètre $\\lambda$. Une étude statistique a montré qu'une fois sur deux, le premier incident survient avant le 62ème kilomètre et une fois sur deux, il survient après le 62ème kilomètre.Quelle est la distance moyenne, arrondie au kilomètre, parcourue par un autocar sans incident ?Calculer la probabilité que la distance parcourue sans incident soit :supérieure à 300 km ;comprise entre 50 et 100 km.Sachant que l'autocar a parcouru 350 kilomètres sans incident, quelle est la probabilité qu'il n'en n'ait pas non plus au cours des 25 kilomètres suivants ?L'entreprise possède $N_0$ autocars. Les distances parcourues par chacun des autocars entre l'entrepôt et le lieu où survient le premier incident sont des variables aléatoires deux à deux indépendantes et de même loi exponentielle de paramètre $\\lambda$. On note $X_d$ la variable aléatoire égale au nombre d'autocars n'ayant subi aucun incident après avoir parcouru $d$ kilomètres.Quelle est la loi de $X_d$ ?Donner le nombre moyen d'autocars n'ayant subi aucun incident après $d$ kilomètres.On note $d_0$ le nombre minimum de kilomètres parcourus par chacun des autocars dans une journée. A partir de quelle valeur de $d_0$ a-t-on au moins 99 chances sur 100 qu'un incident se soit produit dans la flotte ? \r\nApplication numérique : calculer cette valeur lorsque la flotte compte 25 autocars. Commenter.",
    "hint": "",
    "solution": "Traduisons mathématiquement le fait que, une fois sur deux, le premier incident survient avant le 62ème kilomètre et une fois sur deux, il survient après le 62ème kilomètre. Pour la variable aléatoire $D$, cela signifie $P[D\\le 62]=1/2$. De plus $D$ suit une loi exponentielle de paramètre $\\lambda$. Ainsi \r\n$$P[D\\le 62]=1-e^{-\\lambda\\times 62}\\ .$$\r\nOn a donc $e^{-\\lambda\\times 62}=1/2$, ce qui donne $\\displaystyle \\lambda=\\frac{\\ln 2}{62}$ qui est la valeur exacte de $\\lambda$.\r\nOn en déduit que \r\n$$E[D]=\\frac1\\lambda=\\frac{62}{\\ln 2}\\approx 89\\ .$$$P[D\\ge 300]=e^{-\\lambda\\times 300}\\approx 3,5\\%$.\\begin{eqnarray*}\r\nP[50\\le D\\le 100]&=&P[D\\le 100]-P[D\\le 50]\\\\\r\n&=&(1-e^{-\\lambda\\times 100})-(1-e^{\\lambda\\times 50})\\\\&=&e^{-\\lambda\\times 50}-e^{-\\lambda\\times 100}\\\\&\\approx& 24,5\\%\\ .\r\n\\end{eqnarray*}On sait que la variable $D$ est sans mémoire. Donc\r\n$$P[D\\ge 375\\,\\vert\\, D\\ge 350]=P[D\\ge 25]=e^{-\\lambda\\times 25}\\approx 75,6\\%\\ .$$La probabilité qu'un autocar n'ait subi aucun incident après avoir parcouru $d$ kilomètres vaut $P[D\\ge d]=e^{-\\lambda d}$. Il y a $N_0$ autocars et les distances parcourues avant le premier incident sont indépendantes. Ainsi, la variable $X_d$ qui compte le nombre d'autocars n'ayant subi aucun incident suit une loi binomiale de paramètres $N_0$ et $e^{-\\lambda d}$.$E[X_d]=N_0\\times e^{-\\lambda d}$.Pour une distance $d_0$ donnée, dire qu'un incident s'est produit dans la flotte, c'est dire que $X_{d_0}< N_0$. On cherche donc $d_0$ tel que $P[X_{d_0}< N_0]\\ge 99\\%$, ou encore, en passant à l'événement contraire, que $P[X_{d_0}=N_0]\\le 1\\%$. On trouve donc $e^{-\\lambda N_0 d_0}\\le 1\\%$, soit\r\n$$d_0\\ge \\frac{\\ln (100)}{\\lambda N_0}\\ .$$ \r\nSi $N_0=25$ on trouve au kilomètre près $d\\ge 16$ km. Concrètement, si chaque autocar parcourt plus de 16 km dans la journée, on a une très forte probabilité (supérieure à 0,99) que survienne au moins un incident.",
    "lang": "french"
}