{
    "script": "La distance en train entre Paris et Clermont-Ferrand fait environ 400km. Les motrices tombent souvent en panne sur ce trajet. On fait l'hypothèse que cette panne peut se produire de façon uniforme sur tout le trajet. Lorsqu'un train tombe en panne, on doit faire venir une locomotive de rechange. On suppose que la SNCF dispose pour cette ligne de deux locomotives de rechange. Bien sûr, c'est toujours la locomotive la plus proche qui se rend au lieu de la panne.On suppose que les locomotives sont disposées respectivement dans les gares de départ et d'arrivée. Quel est la distance moyenne parcourue par la locomotive de rechange?Un ingénieur de la SNCF se dit : ce serait plus malin de placer les locomotives respectivement au 1/3 et au 2/3 du parcours. Qu'en pensez-vous?Déterminer la position optimale des deux locomotives de secours pour minimiser la distance parcourue par la locomotive de rechange.",
    "hint": "",
    "solution": "Voici deux rédactions possibles pour cette question.Rédaction 1 : il y a une chance sur deux pour que le train tombe en panne plus près de Paris, et une chance sur deux pour que le train tombe en panne plus près de Clermont. Si le train tombe en panne plus près de Paris, la distance parcourue par la locomotive de rechange suit une loi uniforme sur l'intervalle [0,200]. La distance moyenne parcourue (l'espérance de la variable aléatoire) est donc 100 km. C'est la même chose si la locomotive tombe en panne plus près de Clermont-Ferrand. La distance moyenne parcourue par la locomotive de rechange est donc de 100km.Rédaction 2 : On suppose que la locomotive part de Paris, et on note $X$ la variable aléatoire égale au nombre de kilomètres parcourus avant une panne. Alors $X$ suit une loi uniforme sur [0,400]. En particulier, sa densité est $f(x)=\\frac{1}{400}\\mathbf 1_{[0,400]}$.  Notons $g(X)$ la distance parcourue par la locomotive de rechange. Alors $g(X)=X$ si $0\\leq X\\leq 200$ et $g(X)=400-X$ si $200\\leq X\\leq 400$. Par le théorème de transfert, on a donc\r\n$$E(g(X))=\\int_0^{200} xf(x)dx+\\int_{200}^{400}(400-x)f(x)dx=100.$$On peut faire un raisonnement identique à la question précédente, mais cette fois, il y a quatre cas à considérer :si  $X$ est à valeurs dans $[0,400/3]$, la distance parcourue par la locomotive de secours sera égale à $\\frac{400}3-X$;si $X$ est à valeurs dans $[400/3,200]$, la distance parcourue sera égale à $X-400/3$;si $X$ est à valeurs dans $[200,800/3]$, la distance parcourue sera égale à $800/3-X$;si $X$ est à valeurs dans $[800/3,400]$, la distance parcourue sera égale à $X-\\frac{800}3$.Finalement, la distance moyenne vaut (on a utilisé la symétrie par rapport à 200 pour calculer l'intégrale) :\r\n$$\\frac2{400}\\int_0^{400/3} (400/3-x)dx+\\frac2{400}\\int_{400/3}^{200}(x-400/3)dx=\\frac{500}9.$$\r\nC'est effectivement nettement mieux!La solution précédente n'est pas optimale. Pour que cela soit optimal, on \"sent\" qu'il faudrait que les deux locomotives de secours puissent parcourir, en moyenne, la même longueur de trajet de part et d'autre de leur point de rattachement. En voici une démonstration mathématique, sans doute pas la plus simple. Notons $a\\leq b$ les positions des deux locomotives de secours, avec $0\\leq a\\leq b\\leq 400$. Comme à la question précédente, on a les 4 cas :si  $X$ est à valeurs dans $[0,a]$, la distance parcourue par la locomotive de secours sera égale à $a-X$;si $X$ est à valeurs dans $[a,(a+b)/2]$, la distance parcourue sera égale à $X-a$;si $X$ est à valeurs dans $[(a+b)/2,b]$, la distance parcourue sera égale à $b-X$;si $X$ est à valeurs dans $[b,400]$, la distance parcourue sera égale à $X-b$.La distance moyenne parcourue vaut donc \r\n$$\\frac1{400}\\left(\\int_0^a (a-x)dx+\\int_a^{(a+b)/2}(x-a)dx+\\int_{(a+b)/2}^b (b-x)dx+\\int_{b}^{400}(x-b)\\right)$$\r\n$$=\\frac1{400}\\left(\\frac{a^2}2+\\frac{(b-a)^2}4+\\frac{(400-b)^2}2\\right).$$\r\nOn cherche donc à trouver $a,b$ pour minimiser la fonction \r\n$$h(a,b)=\\frac{a^2}2+\\frac{(b-a)^2}4+\\frac{(400-b)^2}2.$$\r\nOn calcule les dérivées partielles de cette fonction :\r\n$$\\frac{\\partial h}{\\partial a}(a,b)=\\frac{3a-b}2\\textrm{ et }\\frac{\\partial h}{\\partial b}(a,b)=\\frac{3b-a}2-400.$$\r\nOn trouve facilement que les deux dérivées partielles s'annulent simultanément uniquement en $a=100$ et $b=300$. La distance moyenne minimale est donc atteinte si la première locomotive est au 1/4 du parcours, et la seconde au 3/4.",
    "lang": "french"
}