{
    "script": "On dit qu'un tétraèdre est orthocentrique si ses quatre hauteurs sont concourantes (on rappelle que la hauteur issue de $A$ d'un tétraèdre $ABCD$ est la droite perpendiculaire au plan $(BCD)$ passant par $A$). On se fixe un tétraèdre $MNPQ$ et on suppose que les hauteurs issues des sommets $M$ et $N$ sont sécantes en un point $K$. Les droites $(MK)$ et $(NK)$ sont donc orthogonales aux plans $(NPQ)$ et $(MPQ)$ respectivement.Justifier que la droite $(PQ)$ est orthogonale à la droite $(MK)$. On admet de même que la droite $(PQ)$ et la droite $(NK)$ sont orthogonales.Que peut-on déduire de la question précédente relativement à la droite $(PQ)$ et au plan $(MNK)$? Justifier la réponse.Montrer que les arêtes $[MN]$ et $[PQ]$ sont orthogonales.Ainsi, on a démontré la propriété suivante : si un tétraèdre est orthocentrique, alors ses arêtes opposées sont orthogonales deux à deux (on dit que deux arêtes d'un tétraèdre sont \"opposées\" lorsqu'elles n'ont pas de sommet commun).Dans un repère orthonormé, on considère les points $R(-3,5,2)$, $S(1,4,-2)$, $T(4,-1,5)$ et $U(4,7,3)$. Le tétraèdre $RSTU$ est-il orthocentrique?",
    "hint": "Une droite est orthogonale à un plan si et seulement si elle est orthogonale à deux droites sécantes de ce plan.Trouver deux arêtes qui ne sont pas orthogonales.",
    "solution": "Puisque la droite $(MK)$ est orthogonale au plan $(NPQ)$, elle est orthogonale à toutes les droites de ce plan. En particulier, elle est orthogonale à $(PQ)$.La droite $(PQ)$ est orthogonale à deux droites sécantes du plan $(MNK)$, les droites $(MK)$ et $(NK)$. Elle est donc orthogonale à ce plan (rappel : si une droite est orthogonale à deux droites sécantes d'un plan $P$, elle est orthogonale à ce plan).Puisque $(PQ)$ est orthogonale à toutes les droites du plan $(MNK)$, elle est en particulier orthogonale à $(MN)$. Donc les arêtes $[MN]$ et $[PQ]$ sont orthogonales.Nous allons démontrer que le tétraèdre $RSTU$ n'est pas orthocentrique. Pour cela, il suffit de trouver deux arêtes qui ne sont pas orthogonales. Mais, \r\n$\\overrightarrow{RT}=(7,-6,3)$ et $\\overrightarrow{SU}=(3,3,5)$. Le produit scalaire de ces deux vecteurs est \r\n\\[\\overrightarrow{RT}\\cdot\\overrightarrow{SU}=21-18+15=18\\neq 0.\\]\r\nAinsi, les arêtes $[RT]$ et $[SU]$ ne sont pas orthogonales. Le tétraèdre n'est pas orthocentrique.",
    "lang": "french"
}