{
    "script": "Une compagnie aérienne exploite un avion Paris-Montréal d'une capacité de 150 places.\r\nPour ce vol, une analyse statistique a montré qu'un passager ayant réservé son billet\r\nse présentait à l'embarquement avec une probabilité de $p=0,\\!75$. La compagnie souhaite\r\noptimiser le remplissage de l'avion et souhaite vendre $n$ billets, avec $n>150$,\r\nmais en limitant le risque que plus de 150 personnes se rendent à l'embarquement\r\nà moins de $5\\%$. On supposera dans la suite que $np< 150$.On définit la variable aléatoire $S_n$ comme le nombre de personnes, parmi les $n$\r\nayant réservé un billet, se présentant à l'embarquement.Quelle est la loi de $S_n$?En remarquant que $(S_n\\geq 150)\\subset (|S_n-np|\\geq 150-np)$, démontrer que \r\n $$P(S_n\\geq 150)\\leq \\frac{np(1-p)}{(150-np)^2}.$$Résoudre sur $]0,150[$ l'inéquation $\\frac{x(1-p)}{(150-x)^2}\\leq 0,\\!05$.Combien la compagnie peut-elle vendre de billets tout en s'assurant que la probabilité que plus de 150 clients se présentent à l'embarquement est inférieure ou égale à $5\\%$?",
    "hint": "On est dans le cadre d'une répétition d'épreuves de Bernoulli indépendantes.Utiliser l'inégalité de Bienaymé-Tchebychev.",
    "solution": "$S_n$ compte le nombre de succès (se présenter à l'embarquement) lors de la réalisation  \r\n de $n$ épreuves de Bernoulli indépendantes de même paramètre $p=0,\\!75$. $S_n$ suit donc une loi binomiale $\\mathcal B(n,p)$.Remarquons que \r\n $$S_n\\geq 150\\implies S_n-np\\geq 150-np\\implies |S_n-np|\\geq |150-np|$$\r\n puisque $150-np\\geq 0$. On peut alors appliquer l'inégalité de Tchebychev qui donne immédiatement le résultat, \r\n puisque $E(S_n)=np$ et $V(S_n)=np(1-p)$.La résolution de cette inéquation du second degré donne $x\\in [0;125]$.Si $np\\leq 125$, en particulier si $n\\leq 166$, alors on sait que $P(S_n\\geq 150)\\leq 0,\\!05$.\r\n Si la compagnie vend 166 billets, la probabilité que plus de 150 clients se présentent à l'embarquement est inférieure à $0,\\!05$.",
    "lang": "french"
}