{
    "script": "Soit $E$ un ensemble à $n$ éléments. On appelle dérangement de $E$ toute permutation de $E$ ne laissant aucun élément invariant. On notera $D_n$ le nombre de dérangements de $E$, avec la convention $D_0=1$.Si $E$ comporte un seul élément, y-a-t-il des dérangements de $E$? En déduire $D_1$.Si $E$ comporte deux éléments, combien y-a-t-il de dérangements de $E$? En déduire $D_2$.On suppose $n$ quelconque, et on écrit $E=\\{a_1,\\dots,a_n\\}$. Soit $f$ une permutation de $E$. On suppose qu'elle laisse $k$ éléments invariants. Combien y-a-t-il de telles permutations? En déduire la formule suivante :\r\n$$n!=\\sum_{k=0}^n \\binom{n}{k} D_k.$$En déduire $D_3,\\ D_4$, $D_5$.Cinq couples de danseurs se rendent à un bal masqué. A l'arrivée, on sépare les hommes et les femmes , on numérote les femmes de 1 à 5 , et les hommes de 1 à 5. On les fait ensuite s'élancer sur une piste , chaque homme choississant au hasard une femme pour partenaire.A chaque numéro de femme, on associe le numéro de l'homme avec lequel elle danse. Combien y-a-t-il d'associations possibles?Donner la probabilité pour qu'aucun couple légitime ne soit reconstitué.Déterminer la probabilité pour qu'un seul couple légitime soit reconstitué.Déterminer la probabilité pour qu'il y ait plus de couples illégitimes sur la piste de danse que de couples légitimes.",
    "hint": "Une permutation d'un tel $E$ peut-elle n'avoir aucun point fixe?Ecrire toutes les permutations de $E$.Compter le nombre de choix d'éléments invariants, puis le nombres de permutations possibles sur les éléments non invariants. Séparer ensuite l'ensemble des permutations de $E$ en fonction de leurs nombre de points invariants.Appliquer successivement la relation précédente pour $n=3$, $n=4$, $n=5$.Exprimer le nombre en terme de permutations.Exprimer le nombre en terme de dérangements.Choisir le couple légitime, puis déranger les autres.Compter aussi le cas où il y a exactement deux couples légitimes.",
    "solution": "Il n'y a qu'une seule permutation de $E$ qui est l'identité. Ce n'est pas un dérangement, $D_1=0$.Des deux permutations de $E$, seule celle qui inverse les deux éléments est un dérangement : $D_2=1$.Il y a $\\binom nk$ choix de $k$ éléments invariants parmi $n$. Une fois ces choix fixés, la permutation est un dérangement sur les ${n-k}$ autres éléments. Il y a donc $\\binom{n}k D_{n-k}$ telles permutations. La convention $D_0=1$ fait que cette formule reste vraie si $k=n$. On sépare ensuite les permutations de $E$ en fonction de leur nombre de points invariants. Comme les ensembles que l'on obtient sont disjoints, et qu'il y a en tout $n!$ permutations de $E$, on obtient :\r\n$$n!=\\sum_{k=0}^{n} \\binom nk D_{n-k}.$$\r\nPour obtenir la formule demandée, il faut ensuite faire le changement d'indices $l=n-k$, et utiliser la propriété des coefficients binômiaux : $\\binom nk=\\binom n{n-k}$.On applique la relation pour $n=3$. On obtient :\r\n$$3!=D_0+3D_1+3D_2+D_3\\implies D_3=2.$$\r\nDe même, en appliquant la relation pour $n=4$, on trouve $D_4=9$, et pour $n=5$, $D_5=44$.Une telle association correspond à une permutation de $\\{1,\\dots,5\\}$. Il y a $5!=120$ telles permutations.Si aucun couple légitime n'est reconstitué, c'est que la permutation précédente est un dérangement. Il y a $D_5=44$ telles associations, et la probabilité recherchée est $44/120=11/30$.Si un seul couple légitime est reconstitué, il y a 5 choix pour le couple. Pour le reste, il faut un dérangement : il y a donc $5\\times D_4=45$ telles possibilités. La probabilité recherchée est $45/120=3/8$.On compte aussi le cas où deux couples légitimes sont reconstitués : il y a $\\binom 52=10$ choix de 2 couples parmi 5. Pour les autres, il faut une association qui soit un dérangement : $10\\times D_3=20$. Le nombre d'associations où il y a plus de couples illégitimes que de couples légitimes est donc : $20+45+44=109$, ce qui donne une probabilité de 109/120>1/2. Le bal masqué favorise les rencontres!",
    "lang": "french"
}