{
    "script": "On cherche à dépister une maladie détectable à l'aide d'un examen sanguin. On suppose que dans notre population, il y a une proportion $p$ de personnes qui n'ont pas cette maladie.On analyse le sang de $r$ personnes de la population, avec $r$ entier au moins égal à 2. On suppose que l'effectif de la population est suffisamment grand pour que le choix de ces $r$ personnes s'apparente à un tirage avec remise. Quelle est la probabilité qu'aucune de ces personnes ne soit atteinte de la maladie?On regroupe le sang de ces $r$ personnes, puis on procède à l'analyse de sang. Si l'analyse est négative, aucune de ces personnes n'est malade et on arrête. Si l'analyse est positive, on fait toutes les analyses individuelles (on avait pris soin de conserver une partie du sang recueilli avant l'analyse groupée). On note $Y$ la variable aléatoire qui donne le nombre d'analyses de sang effectuées. Donner la loi de probabilité de $Y$ et calculer son espérance en fonction de $r$ et de $p$.On s'intéresse à une population de $n$ personnes, et on effectue des analyses collectives après avoir mélangé les prélèvements par groupe de $r$ personnes, où $r$ est un diviseur de $n$. Montrer que le nombre d'analyses que l'on peut espérer économiser, par rapport à la démarche consistant à tester immédiatement toutes les personnes, est égal à $np^r-\\frac nr$.Dans cette question, on suppose que $p=0,9$ et on admet qu'il existe un réel $a>1$ de sorte que la fonction $x\\mapsto p^x-\\frac{1}x$ est croissante sur $[1,a]$ et décroissante sur $[a,+\\infty[$. Écrire un algorithme permettant de déterminer \r\npour quelle valeur de l'entier $r$ le nombre $p^r-\\frac 1r$ est maximal.",
    "hint": "Quelles sont les valeurs prises par $Y$?Utiliser la valeur de l'espérance calculée à la question précédente.",
    "solution": "On note $A_i$ l'événement \"la $i$-ème personne choisie n'est pas malade\". On cherche la probabilité de l'événement $A_1\\cap A_2\\cap\\dots\\cap A_r$. L'énoncé nous dit que $P(A_i)=p$ (proportion $p$ de personnes qui n'ont pas la maladie), et que les événements $A_1,\\dots,A_r$ sont mutuellement indépendants (le choix de ces $r$ personnes s'apparente à un tirage avec remise). On en déduit donc que la probabilité qu'aucune des $r$ personnes ne soit atteinte de la maladie est $p^r$.La variable aléatoire $Y$ peut prendre deux valeurs : la valeur $1$ (l'analyse collective est négative), et la valeur $r+1$ (l'analyse collective est positive, et il faut donc faire également toutes les analyses individuelles). On a de plus $P(Y=1)=p^r$ (l'événement $\\{Y=1\\}$ est aussi l'événement aucune des $r$ personnes n'est malade) et donc $P(Y=r+1)=1-p^r$. On en déduit que \r\n$$E(Y)=p^r+(r+1)(1-p^r)=(r+1)-rp^r.$$Si on analyse immédiatement toutes les personnes, on réalise $n$ analyses. En les regroupant par groupe de $r$ personnes, notons $Z$ le nombre d'analyses effectuées, et $Y_1,\\dots,Y_{n/r}$ le nombre d'analyses effectués sur chacun des $n/r$ groupes constitués. Alors d'après la question précédente, on sait que l'espérance de $Y_i$ est $(r+1)-rp^r.$ Le nombre moyen d'analyses que l'on peut espérer réaliser est donc égal à \r\n$$E(Y_1)+\\dots+E(Y_{n/r})=\\frac nr\\big((r+1)-rp^r\\big).$$\r\nLe nombre d'analyses que l'on peut espérer économiser vaut donc \r\n$$n-\\frac nr\\big((r+1)-rp^r\\big)=n\\left(p^r-\\frac 1r\\right).$$On nous demande donc de donner un algorithme qui détermine le maximum d'une suite croissante, puis décroissante. Voici un algorithme sous Python qui fonctionne.from math import *def maximum():r=1val=-1p=0.9while ((pow(p,r)-1/r)>val):val=(pow(p,r)-1/r)r=r+1return r-1La variable val contient la plus grande valeur atteinte jusqu'au rang présent. Elle est initialisée à un nombre négatif afin que l'on rentre dans la boucle. Il faut bien afficher $r-1$ et non $r$, car quand on sort de la boucle, on a dépassé le maximum.",
    "lang": "french"
}