{
    "script": "Un examen consiste en un QCM de 15 questions. Pour chaque question, 3 réponses sont possibles. Les étudiants répondent à chaque question indépendamment. L'enseignant estime que les étudiants ayant préparé l'examen sont $70\\%$ et répondent à une question correctement avec probabilité 0,8. Les autres étudiants choisissent les réponses au hasard. Il faut au moins 8 bonnes réponses pour réussir l'examen.Quelle est la probabilité qu'un étudiant, choisi au hasard, réussisse l'examen?Si un étudiant échoue, quelle est la probabilité qu'il ait préparé l'examen?",
    "hint": "Noter $A$ l'événement \"l'étudiant a préparé l'examen\", $R$ l'événement \"l'étudiant a réussi l'examen\" et $X$ la variable aléatoire du nombre de questions ayant eu une bonne réponse. On peut donner la loi des variables aléatoires conditionnées $X|A$ et $X|\\bar A$. En déduire $P(R|A)$ et $P(R|\\bar A)$.Formule de Bayes.",
    "solution": "Notons $A$ l'événement \"l'étudiant a préparé l'examen\", $R$ l'événement \"l'étudiant a réussi l'examen\" et $X$ la variable aléatoire du nombre de questions ayant eu une bonne réponse. On ne connait pas directement la loi de $X$, mais il est facile de donner la loi des variables aléatoires \"conditionnées\" $X|A$ et $X|\\bar A$. Elles suivent des lois binomiales de paramètre 15 et, respectivement, 0,8 et 1/3. Plus précisément, pour tout $k$ dans $\\{0,\\dots,15\\}$, on a \r\n$$P(X=k|A)=\\binom{15}k (0,8)^k (0,2)^{15-k}$$\r\n$$P(X=k|\\bar A)=\\binom{15}k \\left(\\frac 13\\right)^k \\left(\\frac 23\\right)^{15-k}.$$\r\nOn en déduit que \r\n$$P(R|A)=\\sum_{k=8}^{15}P(X=k|A)\\simeq 0,996$$\r\ntandis que \r\n$$P(R|\\bar A)=\\sum_{k=8}^{15}P(X=k|\\bar A)\\simeq 0,088.$$\r\nOn en déduit, par la formule des probabilités totales :\r\n$$P(R)=P(A)P(R|A)+P(\\bar A)P(R|\\bar A)\\simeq 0,724.$$D'après la formule de Bayes,\r\n$$P(A|\\bar R)=\\frac{P(\\bar R|A)P(A)}{P(\\bar R)}=\\frac{(1-P(R|A))P(A)}{1-P(R)}\\simeq 0,011.$$\r\nLes résultats des deux questions sont finalement très réconfortants sur la pertinence de cet examen.",
    "lang": "french"
}