{
    "script": "Un joueur tire sur une cible de 10cm de rayon, constituée de couronnes concentriques,\r\ndélimitées par des cercles de rayons 1,2, ..., 10 cm, et numérotées respectivement de 10 à 1. La\r\nprobabilité d’atteindre la couronne $k$ est proportionnelle à l’aire de cette couronne, et on suppose que\r\nle joueur atteint sa cible à chaque lancer. Soit $X$ la variable aléatoire qui à chaque lancer associe le numéro de la cible.Quelle est la loi de probabilité de X ?Le joueur gagne $k$ euros s’il atteint la couronne numérotée $k$ pour $k$ compris entre 6 et 10, tandis qu’il perd 2 euros s’il atteint l’une des couronnes périphériques numérotées de 1 à 5. Le jeu est-il\r\nfavorable au joueur ?",
    "hint": "Calculer l'aire de chaque couronne.Introduire la variable aléatoire égale au gain algébrique du joueur, puis calculer l'espérance de cette variable aléatoire.",
    "solution": "On note $A_k$ l'aire de la couronne $k$, et $A$ l'aire totale. Par les hypothèses d'équiprobabilité faites dans l'énoncé, on a \r\n$$P(X=k)=\\frac{A_k}{A}$$\r\npour $k$ compris entre $1$ et $10$. Pour la couronne $k$, le cercle extérieur est de rayon $11-k$ et le cercle intérieur de rayon $10-k$ (un petit dessin pourra aider pour faire attention à l'inversion entre l'ordre des cercles et les rayons,  et il faut aussi bien faire attention à ce que pour $k=1$, c'est $11-k=10$ qui donne le rayon de la cible). On a donc, en $cm^2$, $A_k=\\pi\\big((11-k)^2-(10-k)^2)=\\pi(21-2k)$. On en déduit que\r\n$$P(X=k)=\\frac{21-2k}{100}.$$Notons $Y$ la variable aléatoire correspondant au gain algébrique du joueur. $Y$ prend ses valeurs dans $-2,6,7,8,9,10$. L'événement $\"Y=-2\"$ est égal à l'événement $\"X\\leq 5\"$, et donc \r\n$$P(Y=-2)=P(X=1)+P(X=2)+P(X=3)+P(X=4)+P(X=5)=\\frac{75}{100}$$\r\nd'après le résultat de la question précédente. \r\nD'autre part, pour $k=6,\\dots,10$, on a \r\n$$P(Y=k)=P(X=k).$$\r\nOn en déduit le calcul de l'espérance de $Y$ :\r\n$$E(Y)=-2\\times\\frac{75}{100}+\\frac{6\\times 9+7\\times 7+8\\times 5+9\\times 3+10\\times 1}{100}=\\frac{3}{10}.$$\r\nL'espérance est positive. Le jeu est favorable au joueur. En moyenne, il peut espérer gagne 0,3 euros par partie.",
    "lang": "french"
}