{
    "script": "Le tableau ci-dessous donne la production annuelle d'une usine de pâte à papier (en tonnes) en fonction de l'année. \r\n$$\r\n\\begin{array}{|c|c|c|c|c|c|c|c|}\r\n2004&2005&2006&2007&2008&2009&2010&2011\\\\\r\n\\hline\r\n325&351&382&432&478&538&708&930\r\n\\end{array}\r\n$$Tracer le nuage de points correspondant (sous logiciel!).Un ajustement affine vous semble-t-il adéquat?Pour chaque année, on note $p_i$ la production de la pâte à papier et $m_i=\\ln(p_i)$. Tracer le nouveau nuage de points $(i,m_i)$ et calculer le coefficient de corrélation linéaire de la série double ($i$, $m_i$). Qu'en pensez-vous?Donner une équation de la droite d'ajustement par les moindres carrés de $m_i$ en $i$.Quelle production peut-on prévoir en 2014?A cette dernière question, voici la réponse de quelques élèves :Elève A : Je remplace 2014 dans l’équation 0,14x – 280,5 : je trouve 1,46. Puis je prends\r\nl’exponentielle : on trouve 4,3. Il doit y avoir une erreur car ce n’est pas assez.Elève B : Puisque $p = e^{0,143i -280,508}$, alors $p(2014)\\simeq 1797$. La production est de 1797 tonnes.Elève C : J'utilise la touche Stats de ma calculatrice et je trouve 1233 tonnes.Elève D : Je sais que $x= 2014$ et $p = 77,79x -155 636,82$.\r\nDonc : $p = 77,79\\times 2014 – 155 636,82 =1032,24$. La production est 1032,24 tonnesAnalysez la production de chaque élève en mettant en évidence ses réussites et en indiquant l'origine éventuelle de ses erreurs.",
    "hint": "",
    "solution": "A savoir faire.L'ajustement affine ne semble pas approprié, l'accroissement de la production entre deux années n'est clairement pas constant et augmente.Le coefficient de corrélation linéaire, qu'on peut calculer sous LibreOffice par la fonction COEFFICIENT.CORRELATION(Données1;Données 2), vaut 0,968.... C'est très proche de 1. D'où l'intérêt d'approcher le nuage de points par une droite.En utilisant les fonctions de Libre Office PENTE(Données Y;Données X) et ORDONNEE.ORIGINE(Données Y:Données X) on trouve une droite $y=ax+b$ avec $a\\simeq 0,143$ et $b\\simeq -280,50$.On calcule d'abord une valeur approchée de $m_{2014}$. Pour éviter le plus possible les erreurs d'arrondis, on utilise les valeurs stockées dans la mémoire du tableur en utilisant les références directes aux cellules (B14) par exemple. On trouve $m_{2014}\\simeq 7,117$ et $p_{2014}\\simeq 1233$. On peut s'attendre à ce que la production soit d'environ 1233 tonnes.L'élève A et l'élève B trouvent tous deux la bonne droite d'ajustement et sont capables de retrouver la production attendue à travers la fonction exponentielle. Cependant, ils ont choisi des arrondis trop abrupts et leurs valeurs ne sont pas celles attendues. L'élève A relève que la valeur trouvée est incohérente. L'élève B se montre trop affirmatif quand il dit que la production est de ... On peut juste affirmer que l'on peut s'attendre à ce que la production soit... L'élève C sait utiliser un bon outil, mais il ne donne pas assez d'explication (utilisation d'une boite noire sans réflexion). L'élève D est revenu à une régression directe de $p_i$ par rapport à $i$.",
    "lang": "french"
}