{
    "script": "On lance une pièce de monnaie dont la probabilité de tomber sur pile vaut p. On note $X$ la variable aléatoire correspondant au nombre de lancers nécessaires pour obtenir $r$ fois pile.Quelle est la loi de $X$?Soit $Y_1,\\dots,Y_r$ des variables aléatoires indépendantes suivant une loi géométrique de paramètre $p$. Démontrer que $Y_1+\\dots+Y_r$ a la même loi que $X$.En déduire l'espérance de $X$ et sa variance.",
    "hint": "Si $X=k$, alors le dernier lancer est un pile, et pour les lancers précédents,\r\npenser à la loi binomiale.Penser à l'interprétation probabiliste de la loi géométrique.",
    "solution": "Il est d'abord clair que $X$ prend ses valeurs dans $\\{r,r+1,\\dots,\\}$. \r\nSoit $k\\geq r$. Remarquons que si $X=k$, alors le dernier lancer est un pile.\r\nPour les lancers précédents, on a obtenu $r-1$ fois pile, parmi $k-1$ lancers. Le\r\nnombre de tirages correspondant à $X=k$ est donc $\\binom{k-1}{r-1}$. La probabilité\r\nde chaque lancer est $p^{r} (1-p)^{k-r}$. On en déduit que :\r\n$$P(X=k)=\\binom{k-1}{r-1}p^r (1-p)^{k-r}.$$On peut proposer deux raisonnements très différents pour cette question. Le premier est calculatoire, en calculant effectivement (par exemple, par récurrence sur $r$), la quantité $P(Y_1+\\dots+Y_r=k)$. Le seconde est probabiliste. On considère une suite de lancers indépendants de la pièce de monnaie considérée dans l'énoncé. Notons $Y_1$ le nombre de lancers nécessaires avant d'obtenir pile. Alors $Y_1$ suit une loi géométrique de paramètre $p$. Le première pile étant obtenu, notons $Y_2$ le nombre de lancers nécessaires, depuis le premier pile, pour obtenir pour la première fois un autre pile. La variable aléatoire $Y_2$ suit aussi une loi géométrique. Plus généralement, notons $Y_i$ le nombre de lancers nécessaires pour obtenir le premier pile après le $i-1$-ème pile. Les $Y_i$ suivent des lois géométriques de paramètre $p$ et sont indépendantes. De plus, $Y_1+\\dots+Y_r$ compte le nombre de lancers nécessaires pour obtenir $r$ piles. On a donc $X=Y_1+\\dots+Y_r$, ce qui donne le résultat.Par linéarité de l'espérance et de la variance (pour des variables aléatoires indépendantes), on a \r\n$$E(X)=E(Y_1)+\\dots+E(Y_r)=\\frac{r}p,\\ V(X)=V(Y_1)+\\dots+V(Y_r)=\\frac{r(1-p)}{p^2}.$$",
    "lang": "french"
}