{
    "script": "Une urne contient initialement une boule blanche et une boule noire indiscernables au toucher. On répète un certain nombre de fois le protocole suivant : on tire au hasard une boule dans l'urne. Si elle est blanche, on arrête. Si elle est noire, on la remet dans l'urne, et on ajoute une boule blanche. On note $Y$ la variable aléatoire correspondant au rang du tirage d'une boule blanche si jamais on en tire une. On convient que $Y=0$ si les tirages n'amènent jamais une boule blanche.Dans cette question uniquement, on suppose que l'on réalise au plus trois tirages.Modéliser cette expérience aléatoire à l'aide d'un arbre de probabilités.Déterminer la loi de probabilité de $Y$.On suppose désormais, et jusqu'à la fin de l'exercice, qu'on répète les tirages jusqu'à obtention d'une boule blanche. Quelles sont les valeurs prises par $Y$?Écrire une fonction Python $\\verb+simulY()+$  qui simule la variable aléatoire $Y.$On note $A_k$ l'événement \"la $k$-ième boule tirée est noire\". Exprimer l'événement $\"Y=k\"$ en fonction des événements $A_1,\\dots,A_k$.Pour $j\\geq 2$, calculer $P(A_j|A_1\\cap \\dots\\cap A_{j-1})$ et $P(\\overline{A_j}|A_1\\cap \\dots\\cap A_{j-1})$.En déduire, pour $k\\geq 1$, la valeur de $P(Y=k)$.Justifier la convergence de la série $\\sum_{k\\geq 1}\\frac k{(k+1)!}$, puis démontrer que $\\sum_{k\\geq 1}\\frac k{(k+1)!}=1$.Quelle est la probabilité pour que l'on ne tire jamais de boule blanche?",
    "hint": "Faire une boucle Tant Que et introduire une variable qui dit quand sortir de la boucle.Quelle est la composition de l'urne si $A_1,\\dots,A_{j-1}$ sont réalisés?Utiliser la formule des probabilités composées.Critère de d'Alembert, ou $\\sum_{k\\geq 0}P(Y=k)=1$.$\\sum_{k\\geq 0}P(Y=k)=1$.",
    "solution": "Voici l'arbre de probabilité attendu, où on a fait une branche \"vers le haut\" si on a tiré une boule blanche, et une branche \"vers le bas\" si on a tiré une boule noire.La variable aléatoire $Y$ prend les valeurs $0,1,2$ et $3$. Grâce à l'arbre précédemment écrit, on a\r\n\\begin{eqnarray*}\r\nP(Y=0)&=&\\frac12\\times\\frac 13\\frac 14=\\frac1{24}\\\\\r\nP(Y=1)&=&\\frac 12\\\\\r\nP(Y=2)&=&\\frac 12\\times\\frac 23=\\frac13\\\\\r\nP(Y=3)&=&\\frac 12\\times\\frac 13\\times\\frac 34=\\frac18.\r\n\\end{eqnarray*}\r\nOn peut remarquer que l'on a bien $P(Y=0)+P(Y=1)+P(Y=2)+P(Y=3)=1$.$Y$ peut désormais prendre ses valeurs dans $\\mathbb N$.Voici une fonction possible :import randomdef simulY():n=1 # Nombre de boules blanches dans l'urnefin=0 # égal à 1 si on vient de tirer une boule blanchewhile (fin==0):if (random.random()<1/(n+1)):n=n+1  # On a tiré la boule noireelse:fin=fin+1 # On a tiré la boule blanche c'est finireturn (n)  # Le nombre de boules blanches donne le nombre de tirages effectuésOn aurait pu aussi remplacer la boucle Répéter... Jusqu'à par une boucle Tant Que.L'événement $\"Y=k\"$ correspond au fait que les $k-1$ premiers tirages amènent une boule noire, et le $k$-ième tirage amène une boule blanche. On a donc \r\n$$\"Y=k\"=A_1\\cap A_2\\cap\\dots\\cap A_{k-1}\\cap \\bar A_k.$$Si $A_1,\\dots,A_{j-1}$ sont tous réalisés, l'urne au moment du $j$-ème tirage est composé d'une boule noire et de $j$ boules blanches. On a donc \r\n$$P(A_j|A_1\\cap\\dots\\cap A_{j-1})=\\frac 1{j+1}.$$\r\nPar un raisonnement similaire, ou par passage au complémentaire, on a \r\n$$P(\\overline{A_j}|A_1\\cap\\dots\\cap A_{j-1})=\\frac j{j+1}.$$Par la formule des probabilités composées (qui est celle qu'on a implicitement utilisée lors de la réalisation de l'arbre), on a\r\n$$P(Y=k)=P(\\overline{A_k}|A_1\\cap A_2\\cap\\dots A_{k-1})P(A_{k-1}|A_1\\cap\\dots\\cap A_{k-1})\\cdots P(A_2|A_1)P(A_1).$$\r\nEn utilisant le résultat de la question précédente, on trouve\r\n$$P(Y=k)=\\frac{k}{k+1}\\times\\frac{1}k\\times\\cdots\\times\\frac 13\\times\\frac 12=\\frac{k}{(k+1)!}.$$Il y a deux possibilités pour justifier la convergence de la série. On peut utiliser des résultats classiques sur les séries, comme le critère de d'Alembert. Posant $u_k=\\frac{k}{(k+1)!}$, qui est positif, on a \r\n$$\\frac{u_{k+1}}{u_k}=\\frac{(k+1)}{k(k+2)}\\to 0<1$$\r\nce qui assure la convergence de la série $\\sum_{k\\geq 1}u_k$. On peut aussi utiliser un argument probabiliste. En effet, $P_Y$ est une probabilité, et donc\r\n$\\sum_{k\\geq 1}P(Y=k)$ converge, et on sait même que sa somme est inférieure ou égale à $1$. Pour calculer la somme de la série, on observe que \r\n$$\\sum_{k\\geq 1}\\frac k{(k+1)!}=\\sum_{k\\geq 1}\\frac{k+1-1}{(k+1)!}=\\sum_{k\\geq 1}\\frac{1}{k!}-\\sum_{k\\geq 1}\\frac{1}{(k+1)!}=1.$$$Y$ étant une variable aléatoire à valeurs dans $\\mathbb N$, on a donc \r\n$$\\sum_{k\\geq 0}P(Y=k)=1.$$\r\nD'où l'on déduit\r\n$$P(Y=0)=1-\\sum_{k\\geq 1}P(Y=k)=0.$$\r\nLa probabilité qu'on ne tire jamais une boule blanche est nulle.",
    "lang": "french"
}