{
    "script": "Une région comporte 10 hôpitaux. Chaque hôpital peut réaliser 10 interventions chirurgicales d'urgence par jour,\r\net on admet que le nombre de personnes se présentant à un hôpital donné un certain jour suit une loi de Poisson de paramètre 8,\r\net que ce nombre est indépendant d'un hôpital à l'autre.On regarde un hôpital. Quelle est la probabilité qu'un jour donné celui-ci soit saturé?Quelle est la probabilité qu'au moins un des 10 hôpitaux soit saturé un jour donné?On suppose que quand un hôpital est saturé, il peut opérer un transfert de malades vers un autre hôpital.\r\n Quelle est la probabilité que le système hospitalier de la région soit saturé?",
    "hint": "La somme de variables indépendantes suivant une loi de Poisson suit une loi de Poisson de paramètre la somme des paramètres.",
    "solution": "Notons $X$ la variable aléatoire égale au nombre de malades se présentant pour une intervention chirurgicale d'urgence dans cet hôpital.\r\n Alors $X$ suit une loi de Poisson de paramètre $8$, et on cherche $P(X\\geq 11)$, ou encore $1-P(X\\leq 10)$. \r\n A l'aide d'un tableur, on trouve grâce à la formule $\\verb+=1-LOI.POISSON(10,8,1)+$ une probabilité d'environ $0,\\!184$.Numérotons les hôpitaux de $1$ à $10$ et notons $A_k$ l'événement : ``le $k$-ième hôpital est saturé''. Alors on sait que\r\n $P(A_k)\\simeq 0,\\!13$. L'événement $B$ ``aucun hôpital n'est saturé'' est égal à \r\n $$B=\\overline{A_1}\\cap\\cdots\\cap\\overline{A_{10}}.$$\r\n Comme les événements $A_1,\\dots,A_{10}$ sont indépendants, on a \r\n $$P(B)=\\prod_{i=1}^{10}P(\\overline{A_i})=(1-P(A_1))^{10}.$$\r\n Finalement, la probabilité recherchée vaut \r\n $$1-P(B)=1-(1-P(A_1))^{10}\\simeq 0,\\!87.$$Notons $X_k$ la variable aléatoire égale au nombre de malades se présentant pour une intervention chirurgicale d'urgence dans l'hôpital $k$, \r\n et $Y=X_1+\\dots+X_{10}$. On cherche $P(Y\\geq 101)$. Or, chaque $X_k$ suit une loi de Poisson de paramètre $8$, et les variables aléatoires\r\n $X_1,\\dots,X_{10}$ sont indépendantes. Donc $Y$ suit une loi de Poisson de paramètre $80$. En raisonnant comme à la première question,\r\n on trouve $P(Y\\geq 101)\\simeq 0,013$. C'est beaucoup moins!",
    "lang": "french"
}