{
    "script": "Le taux d'alcoolémie $f(t)$ (en $\\mathrm g\\!\\cdot\\! \\mathrm L^{-1}$) d'une personne ayant absorbé, à jeun, une certaine quantité d'alcool vérifie  l'équation différentielle $y'(t)+y(t)=ae^{-t}$, où $t\\geq 0$ est le temps écoulé après l'ingestion (exprimé en heures) et $a$ est une constante qui dépend de la quantité d'alcool ingérée et de la personne.Exprimer $f$ en fonction de $t$ et de $a$.On fixe $a=5$.\r\nÉtudier les variations de $f$ et tracer sa courbe.\r\nDéterminer le taux d'alcoolémie maximal et le temps au bout duquel il est atteint.Donner une valeur du délai $T$ (à l'heure près par excès) au bout duquel le taux d'alcoolémie de cette personne est inférieur à $0,5\\,\\mathrm g\\!\\cdot\\! \\mathrm L^{-1}$.",
    "hint": "Résoudre l'équation différentielle. Pour ajuster la constante, il faut bien lire l'énoncé et remarquer que le taux d'alcoolémie au temps initial est nul!L'inéquation que l'on trouve ne se résout pas de façon exacte, mais comme on cherche une solution à l'heure près, il suffit de tracer la courbe ou d'utiliser un tableur.",
    "solution": "Les solutions de l'équation homogène sont les fonctions $y(t)=Ce^{-t}$ avec $C\\in\\mathbb R$. Pour rechercher une solution particulière, on peut par exemple utiliser la méthode de variation de la constante en posant $y(t)=C(t)e^{-t}$. On a alors \r\n$$y'(t)+y(t)=ae^{-t}\\iff C'(t)e^{-t}=ae^{-t}\\iff C'(t)=a.$$\r\nOn en déduit que la fonction $y(t)=ate^{-t}$ est une solution particulière de l'équation et donc le taux d'alcoolémie vérifie $f(t)=(at+C)e^{-t}$ avec $C\\in\\mathbb R$. Puisque $f(0)=0$ (au temps $t=0$, la personne est à jeun), on conclut que $C=0$ et finalement que $f(t)=ate^{-t}$.On a $f'(t)=5(1-t)e^{-t}$ et donc $f'(t)\\geq 0$ sur $[0,1]$ et \r\n$f'(t)\\leq 0$ sur $[1,+\\infty[$. La fonction $f$ est croissante sur $[0,1]$, atteint son maximum en $t=1$, puis est décroissante sur $[1,+\\infty[$. \r\nDe plus, $\\lim_{t\\to +\\infty}f(t)=0$ par croissance comparée des polynômes et de la fonction exponentielle. \r\nLe taux d'alcoolémie maximal est $f(1)=5e^{-1}\\simeq 1,\\!84$.On doit chercher $t\\geq 1$ tel que $f(t)\\leq 0,\\!5$ c'est-à-dire $5te^{-t}\\leq 0,\\!5$. On ne sait pas résoudre exactement (par une formule algébrique) cette inéquation, mais comme on se contente d'avoir une valeur approchée à l'unité près, une lecture graphique est suffisante. La figure précédente montre qu'il faut attendre $4h$ pour que le taux d'alcoolémie redevienne inférieur à $0,5\\,\\mathrm g\\!\\cdot\\! \\mathrm L^{-1}$.",
    "lang": "french"
}